# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'github/gh'
tap 'owenvoke/casks'
tap 'teamookla/speedtest'

# General
brew 'coreutils'
brew 'gawk'
brew 'git'
brew 'gnupg'
brew 'php'
brew 'ripgrep'
brew 'starship'
brew 'zsh'

# Casks
cask 'alfred'
cask 'dbngin'
cask 'discord'
cask 'firefox'
cask 'mediainfo'
cask 'mkvtoolnix'
cask 'tableplus'
cask 'vlc'

# Fonts
cask 'font-firacode-nerd-font'
cask 'font-jetbrainsmono-nerd-font'
cask 'font-roboto'

# GitHub CLI
brew 'github/gh/gh'

# Speedtest CLI
brew 'teamookla/speedtest/speedtest'
