# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'owenvoke/casks'
tap 'teamookla/speedtest'

# General
brew 'coreutils'
brew 'gawk'
brew 'git'
brew 'gh'
brew 'gnupg'
brew 'mas'
brew 'php'
brew 'ripgrep'
brew 'starship'
brew 'tmux'
brew 'yq'
brew 'zsh'

# Casks
cask 'alfred'
cask 'dbngin'
cask 'discord'
cask 'firefox'
cask 'helo'
cask 'mediainfo'
cask 'mkvtoolnix'
cask 'tableplus'
cask 'tinkerwell'
cask 'vlc'
cask 'zettlr'

# Fonts
cask 'font-firacode-nerd-font'
cask 'font-jetbrainsmono-nerd-font'
cask 'font-roboto'

# Speedtest CLI
brew 'teamookla/speedtest/speedtest'

# Mac App Store
mas "Microsoft Remote Desktop", id: 1295203466
mas "WireGuard", id: 1451685025
