# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'owenvoke/casks'
tap 'shivammathur/php'
tap 'teamookla/speedtest'

# General
brew 'asciinema'
brew 'caddy'
brew 'composer'
brew 'coreutils'
brew 'curl'
brew 'ffmpeg'
brew 'fswatch'
brew 'gawk'
brew 'git'
brew 'git-extras'
brew 'gh'
brew 'gnupg'
brew 'mas'
brew 'node'
brew 'ripgrep'
brew 'starship'
brew 'tmux'
brew 'yq'
brew 'zsh'

# PHP
brew 'shivammathur/php/php'
brew 'shivammathur/php/php@8.0'

# Casks
cask 'alfred'
cask 'android-file-transfer'
cask 'beyond-compare'
cask 'dbngin'
cask 'discord'
cask 'firefox'
cask 'helo'
cask 'iconset'
cask 'insomnia'
cask 'invoker'
cask 'jetbrains-toolbox'
cask 'mediainfo'
cask 'mkvtoolnix'
cask 'private-internet-access'
cask 'tableplus'
cask 'tinkerwell'
cask 'vlc'
cask 'vscodium'
cask 'zettlr'

# Fonts
cask 'font-firacode-nerd-font'
cask 'font-jetbrainsmono-nerd-font'
cask 'font-roboto'

# Speedtest CLI
brew 'teamookla/speedtest/speedtest'

# Mac App Store
mas "Microsoft Remote Desktop", id: 1295203466
mas "WireGuard", id: 1451685025
