# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'owenvoke/casks'
tap 'shivammathur/php'
tap 'teamookla/speedtest'

# General
brew 'act'
brew 'asciinema'
brew 'caddy'
brew 'composer'
brew 'coreutils'
brew 'curl'
brew 'duf'
brew 'ffmpeg'
brew 'fswatch'
brew 'gawk'
brew 'git'
brew 'git-extras'
brew 'gh'
brew 'gnupg'
brew 'go'
brew 'httpie'
brew 'ipfs'
brew 'jq'
brew 'mas'
brew 'nano'
brew 'node'
brew 'ripgrep'
brew 'solidity'
brew 'speedtest-cli'
brew 'starship'
brew 'tmux'
brew 'yadm'
brew 'yq'
brew 'zsh'

# PHP
brew 'shivammathur/php/php'
brew 'shivammathru/php/php@7.4'
brew 'shivammathur/php/php@8.1'

# Casks
cask '1password'
cask 'alfred'
cask 'android-file-transfer'
cask 'beyond-compare'
cask 'dbngin'
cask 'discord'
cask 'firefox'
cask 'handbrake'
cask 'helo'
cask 'iconset'
cask 'inkscape'
cask 'insomnia'
cask 'invoker'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'ledger-live'
cask 'mediainfo'
cask 'mkvtoolnix'
cask 'phpmon'
cask 'tableplus'
cask 'tinkerwell'
cask 'vlc'
cask 'vscodium'
cask 'zettlr'

# Games
cask 'runescape'

# Fonts
cask 'font-firacode-nerd-font'
cask 'font-jetbrainsmono-nerd-font'
cask 'font-roboto'

# Speedtest CLI
brew 'teamookla/speedtest/speedtest'

# Mac App Store
mas "Microsoft Remote Desktop", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Pixel Studio", id: 1477015249
